/****************************************************************************************************
//
//		KLCollision.h
//
//		@brief	KoudoLib コリジョン管理
//		@author	Yasushi Hirakawa
//		@date	2015/12/04
//
****************************************************************************************************/

#ifndef __KLCOLLISION_H__
#define __KLCOLLISION_H__


//---------------------------------------------------------------------------------------------
//	include
//---------------------------------------------------------------------------------------------
#include "KLCommon.h"

//---------------------------------------------------------------------------------------------
//	struct
//--------------------------------------------------------------------------------------------- 

// 球コリジョン
struct KLCollisionSphere
{
	BoundingSphere		sphere;		// 球情報
	ContainmentType		collision;	// コリジョン情報
};

// 箱コリジョン
struct KLCollisionBox
{
	BoundingOrientedBox box;		// 箱情報
	ContainmentType		collision;	// コリジョン情報
};


//---------------------------------------------------------------------------------------------
//	class
//---------------------------------------------------------------------------------------------
class KLCollision
{
public:
	KLCollision();
	~KLCollision();

	BOOL Init();				// 初期化
	VOID Destroy();				// 破棄
	VOID Update();				// 更新


private:
};


#endif //__KLAUDIO_H__