/****************************************************************************************************
//
//		KLCommon.cpp
//
//		@brief	KoudoLib 共通定義
//		@author	Yasushi Hirakawa
//		@date	2016/08/23
//
****************************************************************************************************/

#include "KLCommon.h"

//---------------------------------------------------------------------------------------------
//	Static Member
//---------------------------------------------------------------------------------------------
wchar_t			KLCommon::window_name_[kStrMax];
HWND			KLCommon::window_handle_;


//---------------------------------------------------------------------------------------------
//	Method
//---------------------------------------------------------------------------------------------
/*---------------------------------------------------------------------------------------------
//	@brief	マルチバイト文字列からワイド文字列に変換
//
//	@param	mbStr	変換したいマルチバイト文字列
//	@param	wStr	変換後の格納用ワイド文字列
---------------------------------------------------------------------------------------------*/
void KLCommon::MultibyteToWide(const char* mbStr, wchar_t* wStr)
{
	size_t	ret;
	wchar_t	w_str[kStrMax];

	setlocale(LC_CTYPE, "jpn");
	mbstowcs_s(&ret, w_str, kStrMax, mbStr, _TRUNCATE);

	wcscpy_s(wStr, ret, w_str);
}

/*---------------------------------------------------------------------------------------------
//	@brief	ウィンドウハンドルの設定
//
//	@param	HWND hWnd	：ウィンドウハンドル
---------------------------------------------------------------------------------------------*/
void KLCommon::SetWindowHandle(HWND hWnd)
{
	// ウィンドウハンドルの設定
	window_handle_ = hWnd;

	// ウィンドウ名の取得
	window_handle_ = hWnd;
	GetClassName(window_handle_, window_name_, kStrMax);
}

